tsung/many-requests-few-clients.xml
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE tsung SYSTEM "/usr/share/tsung/tsung-1.0.dtd">
<!--<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd">-->

<tsung loglevel="info">
  <clients>
    <client host="localhost" maxusers="20000" use_controller_vm="true"/>
  </clients>

  <servers>
    <server host="localhost" port="80" type="tcp"/>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users maxnumber="20" arrivalrate="20" unit="second"/>
    </arrivalphase>
  </load>

    <sessions>
    <session name="load_test" probability="100" type="ts_http">

      <for from="1" to="200" incr="1" var="counter">
          <request subst="true">
            <http url="http://localhost:80/incoming-data" method="POST"
                  contents="DbkYpUIV+ywhQR0yWp5CJS+XnUIqETE3NDc1Njk1NjkuMTQ4NTEzMhUIARIHVElUQU4gVh0AAL5CJQAA3kI="/>
          </request>
          <thinktime value="0.05"/>
      </for>
    </session>
  </sessions>


</tsung>